---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalColumnRigidLink
source: html/800059cc-d016-4e15-96c3-d1c2d1127214.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalColumnRigidLink Property

"Analytical Links"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAnalyticalColumnRigidLink { get; }
```